Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The commands for moving by WORDs are also uppercase, as this figure shows:
es_es: Las órdenes para desplazarse por PALABRAS están también en mayúsculas, como muestra la siguiente figura:

source: ge b w e <- <- ---> ---> This is-a line, with special/separated/words (and some more).
es_es: ge b w e <- <- ---> ---> Ésta es-una línea, con palabras separadas/de forma/especial (y algo más).

source: The "$" command moves the cursor to the end of a line.
es_es: La orden «$» mueve el cursor al final de la línea.

source: If your keyboard has an <End> key it will do the same thing.
es_es: Si su teclado tiene la tecla <Fin>, conseguirá el mismo resultado pulsándola.

source: The "^" command moves to the first non-blank character of the line.
es_es: La orden «^» le lleva hacia el primer carácter no vacío de la línea.

source: The "0" command (zero) moves to the very first character of the line.
es_es: La orden «0» (cero) le mueve al primer carácter de la línea.

source: The <Home> key does the same thing.
es_es: La tecla <Inicio> hace lo mismo.

source: In a picture:
es_es: En una imagen:

source: The "$" command takes a count, like most movement commands.
es_es: La orden «$» admite un multiplicador, como la mayoría de órdenes de evento.

source: But moving to the end of the line several times doesn't make sense.
es_es: Pero moverse hacia el final de la línea varias veces no tiene sentido.

source: Therefore it causes the editor to move to the end of another line.
es_es: Por lo tanto, lo que hace es moverle hacia el final de la siguiente línea.

source: For example, "1$" moves you to the end of the first line (the one you're on), "2$" to the end of the next line, and so on.
es_es: Por ejemplo, «1$» le mueve hacia el final de la primera línea (en la que está), «2$» te mueve al final de la siguiente línea, y así en adelante.

source: The "0" command doesn't take a count argument, because the "0" would be part of the count.
es_es: La orden «0» no admite ningún multiplicador, porque el «0» podría ser parte del número.

source: Unexpectedly, using a count with "^" doesn't have any effect.
es_es: Usar un multiplicador con «^» tampoco tiene ningún efecto.

source: One of the most useful movement commands is the single-character search command.
es_es: Uno de las órdenes de movimiento más útiles es la orden de búsqueda de un único carácter.

source: The command "fx" searches forward in the line for the single character x.
es_es: La orden «fx» busca hacia delante en la línea el carácter x.

source: Hint: "f" stands for "Find".
es_es: Truco: «f» viene de «Find» (en inglés, buscar).

source: For example, you are at the beginning of the following line.
es_es: Por ejemplo, está al principio de la línea siguiente.

source: Suppose you want to go to the h of human.
es_es: Suponga que quiere ir a la «h» de «humano».

source: Just execute the command "fh" and the cursor will be positioned over the h:
es_es: Ejecute la orden «fh» y el cursor se posicionará sobre la h:

source: This also shows that the command "fy" moves to the end of the word really.
es_es: Esto también muestra que la orden «d» le lleva al comienzo de la palabra «de».

source: You can specify a count; therefore, you can go to the "l" of "foul" with "3fl":
es_es: Puede especificar un multiplicador; por lo tanto, puede ir a la «r» de «verdad» con «3fr»:

source: The "tx" command works like the "fx" command, except it stops one character before the searched character.
es_es: La orden «tx» funciona como la orden «fx», salvo que para un carácter antes del buscado.

source: Hint: "t" stands for "To".
es_es: Truco: «t» viene de «To».

source: The backward version of this command is "Tx".
es_es: La versión inversa de esta orden es «Tx».

source: These four commands can be repeated with ";".
es_es: Estas cuatro órdenes se pueden repetir con «;».

source: "," repeats in the other direction.
es_es: «,» repite en la otra dirección.

source: The cursor is never moved to another line.
es_es: El cursor nunca se mueve a otra línea.

source: Not even when the sentence continues.
es_es: Ni siquiera cuando la frase continúa.

source: Sometimes you will start a search, only to realize that you have typed the wrong command.
es_es: En ciertas ocasiones comenzará la búsqueda y se dará cuenta de que ha tecleado la orden errónea.

source: You type "f" to search backward, for example, only to realize that you really meant "F".
es_es: Por ejemplo, pulsa «f» para buscar hacia atrás, y se da cuenta de que tenía que haber pulsado «F».

source: To abort a search, press <Esc>.
es_es: Para abortar la búsqueda, pulse <Esc>.

source: So "f<Esc>" is an aborted forward search and doesn't do anything.
es_es: Por lo tanto, «f<Esc>» es una búsqueda abortada.

source: Note: <Esc> cancels most operations, not just searches.
es_es: Nota: <Esc> cancela la mayoría de las operaciones, no sólo búsquedas.

source: When writing a program you often end up with nested () constructs.
es_es: Al escribir código, a menudo usa constructos anidados del tipo ().

source: Then the "%" command is very handy: It moves to the matching paren.
es_es: Para ello la orden «%x resulta muy útil: le desplaza hasta el paréntesis opuesto.

source: If the cursor is on a "(" it will move to the matching ")".
es_es: Si el cursor está en un «(», le moverá hasta el «)».

source: If it's on a ")" it will move to the matching "(".
es_es: Si está en un «)» le moverá hasta el «(» correspondiente.

source: This also works for [] and {} pairs.
es_es: Esto también funciona para parejas de [] y {}.

source: (This can be defined with the 'matchpairs' option.)
es_es: (Esto se puede definido con la opción 'matchpairs'.)

source: This tells you that you might want to fix something on line 33.
es_es: Esto le indica que probablemente quiera arreglar algo en la línea 33.

source: So how do you find line 33?
es_es: Entonces, ¿cómo encuentra la línea 33?

source: One way is to do "9999k" to go to the top of the file and "32j" to go down thirty two lines.
es_es: Un modo es hacer «9999k» para ir a la parte superior del archivo y «32j» para ir hacia abajo 32 líneas.

source: It is not a good way, but it works.
es_es: Este no es el mejor modo, pero funciona.

source: A much better way of doing things is to use the "G" command.
es_es: Uno mucho mejor es usar la orden «G».

source: With a count, this command positions you at the given line number.
es_es: Con un multiplicador, esta orden le posiciona en la línea indicada.

source: For example, "33G" puts you on line 33.
es_es: Por ejemplo, «33G» le lleva a la línea 33.

source: (For a better way of going through a compiler's error list, see |usr_30.txt|, for information on the :make command.) With no argument, "G" positions you at the end of the file.
es_es: (Hay un modo aún mejor de ir por la lista de errores del compilador, consulte |usr_30.txt| para información sobre «:make».) Sin argumentos, «G» le posiciona al final del archivo.

source: A quick way to go to the start of a file use "gg".
es_es: Una forma rápida de ir al comienzo de la línea es usar «gg».

source: "1G" will do the same, but is a tiny bit more typing.
es_es: «1G» hará lo mismo, pero es una pizca más lento de escribir.

source: Another way to move to a line is using the "%" command with a count.
es_es: Otra manera de ir a una línea es con la orden «%» y un multiplicador.

source: For example "50%" moves you to halfway the file.
es_es: Por ejemplo «50%» le mueve a la mitad del archivo.

source: "90%" goes to near the end.
es_es: «90%» va casi al final.

source: The previous assumes that you want to move to a line in the file, no matter if it's currently visible or not.
es_es: Lo anterior asume que se quiere mover a una línea en un archivo, no importa si está visible o no.

source: What if you want to move to one of the lines you can see?
es_es: Pero ¿qué pasa si se quiere mover a una de las líneas que puede ver?

source: This figure shows the three commands you can use:
es_es: Esta figura le muestra las tres órdenes que puede emplear:

source: Use the CTRL-G command.
es_es: Use la orden CTRL-G.

source: You get a message like this (assuming the 'ruler' option is off):
es_es: Obtendrá un mensaje como este (asumiendo que la opción 'ruler' está desactivada:

source: This shows the name of the file you are editing, the line number where the cursor is, the total number of lines, the percentage of the way through the file and the column of the cursor.
es_es: Esto le muestra el nombre del archivo que está editando, el número de línea en el que se encuentra su cursor, la posición relativa (en porcentaje) y la columna del cursor.

source: Sometimes you will see a split column number.
es_es: A veces verá dos números separados por guión.

source: For example, "col 2-9".
es_es: Por ejemplo, «col 2-9».

source: This indicates that the cursor is positioned on the second character, but because character one is a tab, occupying eight spaces worth of columns, the screen column is 9.
es_es: Esto indica que el cursor está posicionado en el segundo carácter, pero ya que el primer carácter es un tabulador, ocupará ocho espacios de columnas, y la columna en pantalla será 9.

source: Set the 'number' option.
es_es: Definir la opción 'number'.

source: This will display a line number in front of every line: >
es_es: Esto mostrará el número de línea al principio de cada línea: >

source: :set nonumber < Since 'number' is a boolean option, prepending "no" to its name has the effect of switching it off.
es_es: :set nonumber < Ya que 'number' es una opción booleana, al escribirla con el prefijo «no» produce el efecto de apagarla.

source: A boolean option has only these two values, it is either on or off.
es_es: Una opción booleana tiene sólo estos dos posibles valores, «apagado» o «encendido».

source: Vim has many options.
es_es: Vim tiene muchas opciones.

source: Besides the boolean ones there are options with a numerical value and string options.
es_es: Además de las booleanas, hay opciones con un valor numérico y otras de cadenas de caracteres.

source: You will see examples of this where they are used.
es_es: Verá ejemplos de esto donde sean usados.

source: Set the 'ruler' option.
es_es: Activar la opción 'ruler'.

source: This will display the cursor position in the lower right corner of the Vim window: >
es_es: Esto mostrará la posición del cursor en la esquina inferior a la derecha de la ventana de Vim: >

source: The CTRL-U command scrolls down half a screen of text.
es_es: La orden CTRL-U desplaza el texto hacia abajo.

source: Think of looking through a viewing window at the text and moving this window up by half the height of the window.
es_es: Imagine que mira a través de una ventana hacia un texto y mueve esta ventana hacia arriba una distancia igual a la mitad de la ventana.

source: Thus the window moves up over the text, which is backward in the file.
es_es: Entonces la ventana se mueve hacia arriba sobre el texto, lo cuál es hacia arriba en el archivo.

source: Don't worry if you have a little trouble remembering which end is up.
es_es: No se preocupe si no recuerda qué es hacia arriba.

source: Most users have the same problem.
es_es: A la mayoría de los usuarios les pasa.

source: The CTRL-D command moves the viewing window down half a screen in the file, thus scrolls the text up half a screen.
es_es: La orden CTRL-D mueve la ventana de visualización media pantalla hacia abajo, con lo que desplaza el texto hacia arriba media pantalla.

source: To scroll one line at a time use CTRL-E (scroll up) and CTRL-Y (scroll down).
es_es: Para bajar una sola línea use CTRL-E (avanzar) y CTRL-Y (retroceder).

source: Think of CTRL-E to give you one line Extra.
es_es: Piense en CTRL-E como si le diese una línea Extra.

source: (If you use MS-Windows compatible key mappings CTRL-Y will redo a change instead of scroll.)
es_es: (Si usa un mapa de teclado compatible con MS-Windows CTRL-Y rehará un cambio en lugar de desplazar el texto.)

source: To scroll forward by a whole screen (except for two lines) use CTRL-F.
es_es: Para avanzar una pantalla completa (menos dos líneas) use CTRL-F.

source: The other way is backward, CTRL-B is the command to use.
es_es: La otra manera es hacia atrás, y se usa CTRL-B.

source: Fortunately CTRL-F is Forward and CTRL-B is Backward, that's easy to remember.
es_es: Afortunadamente CTRL-F es Forward y CTRL-B es Backward, lo cuál lo hace fácil de recordar si sabe algo de inglés.

source: The "zt" command puts the cursor line at the top, "zb" at the bottom.
es_es: La orden «zt» pone la línea del cursor arriba, «zb» la situa en la parte inferior.

source: There are a few more scrolling commands, see |Q_sc|.
es_es: Hay algunas órdenes más de desplazamiento de texto, consulte |Q_sc|.

source: To always keep a few lines of context around the cursor, use the 'scrolloff' option.
es_es: Para mantener siempre contexto alrededor del cursor, use la opción 'scrolloff'.

source: To search for a string, use the "/string" command.
es_es: Para buscar una cadena, use la orden «/cadena».

source: To find the word include, for example, use the command: >
es_es: Para encontrar la palabra «include», por ejemplo, use la orden: >

source: You will notice that when you type the "/" the cursor jumps to the last line of the Vim window, like with colon commands.
es_es: Notará que cuando pulsa «/» el cursor salta a la última línea de la ventana Vim, como con la orden «:».

source: That is where you type the word.
es_es: Ahí es donde teclea la palabra.

source: You can press the backspace key (backarrow or <BS>) to make corrections.
es_es: Puede pulsar la tecla de retroceso (flecha hacia atrás o <Retroceso>) para corregir.

source: Use the <Left> and <Right> cursor keys when necessary.
es_es: Use las teclas de cursor cuando sea necesario.

source: Pressing <Enter> executes the command.
es_es: Presione <Intro> para ejecutar la orden.

source: To find the next occurrence of the same string use the "n" command.
es_es: Para encontrar la próxima cadena use la orden «n».

source: Use this to find the first #include after the cursor: >
es_es: Use esto para encontrar el primer #include después del cursor: >

source: And then type "n" several times.
es_es: Ahora pulse «n» varias veces.

source: You will move to each #include in the text.
es_es: Le llevará a cada #include en el texto.

source: You can also use a count if you know which match you want.
es_es: Puede también usar un multiplicador si sabe qué cadenas coincidentes quiere.

source: Thus "3n" finds the third match.
es_es: Por lo tanto «3n» va a la tercera.

source: Using a count with "/" doesn't work.
es_es: No se puede usar con «/».

source: The "N" command repeats the last search the opposite direction.
es_es: La orden «N» repite la última búsqueda en la dirección opuesta.

source: Thus using "N" after a "/" command search backwards, using "N" after "?" searches forward.
es_es: Por lo tanto, usar «N» después de una orden «/» busca hacia atrás, usar «N» tras «?» busca hacia delante.

source: Normally you have to type exactly what you want to find.
es_es: Normalmente tiene que teclear exactamente lo que quieres encontrar.

source: If you don't care about upper or lowercase in a word, set the 'ignorecase' option: >
es_es: Si no le importa si los caracteres están en mayúscula/minúscula, active 'ignorecase': >

source: If you now search for "word", it will also match "Word" and "WORD".
es_es: Si ahora busca «palabra», también le identificará «Palabra» y «PALABRA».

source: To match case again: >
es_es: Para concordar con mayúsculas y minúsculas de nuevo: >

source: Now let's start searching by typing a simple "/" without pressing <Enter>.
es_es: Ahora comience a buscar tecleando un simple «/» sin presionar <Intro>.

source: If you press <Up> (the cursor key), Vim puts "/three" on the command line.
es_es: Si presiona <Arriba> (la tecla de cursor), Vim introduce «tres» en la línea de órdenes.

source: Pressing <Enter> at this point searches for three.
es_es: Presionar <Intro> en este punto busca «tres».

source: If you do not press <Enter>, but press <Up> instead, Vim changes the prompt to "/two".
es_es: Si no pulsa <Intro> y presiona <Arriba>, Vim cambia el texto a «/dos».

source: Another press of <Up> moves you to "/one".
es_es: Si pulsa de nuevo <Arriba>, verá «/uno».

source: You can also use the <Down> cursor key to move through the history of search commands in the other direction.
es_es: Puede usar también la tecla de cursor <Abajo> para moverse por el historial de órdenes de búsqueda en la otra dirección.

source: If you know what a previously used pattern starts with, and you want to use it again, type that character before pressing <Up>.
es_es: Si sabe cómo comienza una de sus búsquedas anteriores y la quiere usar de nuevo, introduzca ese carácter antes de presionar <Arriba>.

source: With the previous example, you can type "/o<Up>" and Vim will put "/one" on the command line.
es_es: En el ejemplo anterior, teclea «/u<Arriba>» y Vim pondrá «/uno» en la línea de órdenes.

source: The commands starting with ":" also have a history.
es_es: Las órdenes que comienzan con «:» también tienen un historial.

source: That allows you to recall a previous command and execute it again.
es_es: Esto ayuda a reutilizar órdenes que ha usado antes.

source: These two histories are separate.
es_es: Estos dos historiales son independientes.

source: If you type "/the" it will also match "there".
es_es: Si teclea «/el» también le identificará «ellos».

source: To only find words that end in "the" use: >
es_es: Para buscar sólo palabras que terminen en «el», use: >

source: The "\>" item is a special marker that only matches at the end of a word.
es_es: El elemento z\>» es un marcador especial que sólo identifica el final de una palabra.

source: Similarly "\<" only matches at the begin of a word.
es_es: De igual modo, «\<» identifica el comienzo de una palabra.

source: Thus to search for the word "the" only: >
es_es: Por lo tanto para buscar únicamente la palabra completa: >

source: This does not match "there" or "soothe".
es_es: Esto no encontrará «ellos» o «mantel».

source: Notice that the "*" and "#" commands use these start-of-word and end-of-word markers to only find whole words (you can use "g*" and "g#" to match partial words).
es_es: Fíjese en que las órdenes «*» y «#» usan estos marcadores de comienzo y final de palabra para encontrar únicamente palabras completas (puede usar «g*» y «g#» para concordancias parciales).

source: While editing a program you see a variable called "nr".
es_es: Al editar un programa verá una variable llamada «nr».

source: You want to check where it's used.
es_es: Quiere comprobar dónde se usa.

source: You could move the cursor to "nr" and use the "*" command and press "n" to go along all the matches.
es_es: Puede mover el cursor a «nr» y usar la orden «*» y presionar «n» para ir de cadena en cadena.

source: There is another way.
es_es: Pero hay otro modo.

source: Type this command: >
es_es: Teclee la siguiente orden: >

source: If you now search for "nr", Vim will highlight all matches.
es_es: Si ahora busca «nr», Vim le destacará todas las concordancias.

source: That is a very good way to see where the variable is used, without the need to type commands.
es_es: Este es un método muy bueno para ver dónde se emplea la variable, sin la necesidad de «n».

source: To switch this off: >
es_es: Para desactivarlo: >

source: Then you need to switch it on again if you want to use it for the next search command.
es_es: Necesita activarlo de nuevo si quiere usarlo para la siguiente orden de búsqueda.

source: If you only want to remove the highlighting, use this command: >
es_es: Si sólo quiere que desaparezca, use: >

source: This doesn't reset the option.
es_es: Esto no modifica la opción.

source: Instead, it disables the highlighting.
es_es: En su lugar, quita las marcas.

source: As soon as you execute a search command, the highlighting will be used again.
es_es: Tan pronto como vuelva a buscar algo, las marcas se volverán a emplear.

source: Also for the "n" and "N" commands.
es_es: También ocurrirá con las órdenes «n» y «N».

source: There are a few options that change how searching works.
es_es: Hay algunas opciones que modifican el modo en el que la búsqueda se realiza.

source: These are the essential ones: > :set incsearch
es_es: Estas son las esenciales: > :set incsearch

source: This makes Vim display the match for the string while you are still typing it.
es_es: Esto hace que Vim muestre la concordancia de la cadena mientras aún la teclea.

source: Use this to check if the right match will be found.
es_es: Use esto para ver si la cadena correcta será encontrada.

source: Then press <Enter> to really jump to that location.
es_es: Pulse luego <Intro> para saltar a su localización.

source: Or type more to change the search string.
es_es: Puede también modificar la cadena.

source: This stops the search at the end of the file.
es_es: Esto detiene la búsqueda al final del archivo.

source: Or, when you are searching backwards, at the start of the file.
es_es: O, cuando buscas hacia atrás, al comienzo del archivo.

source: The 'wrapscan' option is on by default, thus searching wraps around the end of the file.
es_es: La opción 'wrapscan' se activa por omisión, por lo que buscará dando la vuelta al texto.

source: If you like one of the options mentioned before, and set it each time you use Vim, you can put the command in your Vim startup file.
es_es: Si le gusta alguna de las opciones mencionadas previamente, y la activa cada vez que usa Vim, puede poner la orden en el archivo de arranque de Vim.

source: Edit the file, as mentioned at |not-compatible|.
es_es: Edite el archivo, como se describe en |not-compatible|.

source: Or use this command to find out where it is: >
es_es: Puede usar la siguiente orden para ver dónde se encuentra: >

source: Then add a line with the command to set the option, just like you typed it in Vim.
es_es: Ahora añada una línea con la orden para activar la opción, del mismo modo que lo introdujo en Vim.

source: The ^ character matches the beginning of a line.
es_es: El carácter «^» identifica el comienzo de línea.

source: On an English-US keyboard you find it above the 6.
es_es: En un teclado Español-España lo encontrará a la derecha de la «p».

source: The pattern "include" matches the word include anywhere on the line.
es_es: El patrón «include» concuerda la palabra «include» en cualquier parte de una línea.

source: But the pattern "^include" matches the word include only if it is at the beginning of a line.
es_es: Pero el patrón «^include» concuerda la palabra «include» sólo si se encuentra al comienzo de la línea.

source: The $ character matches the end of a line.
es_es: El carácter $ coincide el final de línea.

source: Therefore, "was$" matches the word was only if it is at the end of a line.
es_es: Por lo tanto, "era$" concuerda la palabra «era» sólo si esta se encuentra al final de una línea.

source: You can try searching with "/^the$", it will only match a single line consisting of "the".
es_es: Puede intentar buscar con «/^que$», que sólo se emparejará con una única línea consistente en «que».

source: White space does matter here, thus if a line contains a space after the word, like "the ", the pattern will not match.
es_es: El espacio en blanco se considera, por lo que si contiene un espacio tras la palabra, como «que», el patrón no coincide.

source: If you really want to match a dot, you must avoid its special meaning by putting a backslash before it.
es_es: Si realmente desea coinciordar un punto, debe suprimir su significado especial poniendo antes una barra inversa.
